Workspace/02-transonic-dlrbuffet-hisa-viscous/setups.orig/common/0.orig/back/cellDist
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      cellDist;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
64256
(
6
6
6
6
6
6
6
6
...
)
;

boundaryField
{
    Blade
    {
        type            zeroGradient;
    }
    INLET
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    row_1_PER1
    {
        type            cyclic;
        value           nonuniform List<scalar> 
536
(
6.981613786
6.981754667
6.981923284
6.982126046
6.982368193
6.9826595
6.983008095
6.983425889
...
)
;
    }
    row_1_PER2
    {
        type            cyclic;
        value           nonuniform List<scalar> 
536
(
6.981612234
6.981758212
6.98193332
6.9821433
6.982394702
6.982696558
6.983058198
6.983491358
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
