Workspace/02-transonic-dlrbuffet-hisa-viscous/setups.orig/common/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "1e-08/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

11
(
    row_1_PER2_6
    {
        type            cyclic;
        inGroups        2(row_1_PER2 cyclic);
        nFaces          236;
        startFace       203504;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  row_1_PER1_7;
        separationVector (0 -0.0495 0);
    }
    row_1_PER1_7
    {
        type            cyclic;
        inGroups        2(row_1_PER1 cyclic);
        nFaces          236;
        startFace       203740;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  row_1_PER2_6;
        separationVector (0 0.0495 0);
    }
    row_1_PER2_15
    {
        type            cyclic;
        inGroups        2(row_1_PER2 cyclic);
        nFaces          236;
        startFace       203976;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  row_1_PER1_16;
        separationVector (0 -0.0495 0);
    }
    row_1_PER1_16
    {
        type            cyclic;
        inGroups        2(row_1_PER1 cyclic);
        nFaces          236;
        startFace       204212;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  row_1_PER2_15;
        separationVector (0 0.0495 0);
    }
    row_1_PER2_25
    {
        type            cyclic;
        inGroups        2(row_1_PER2 cyclic);
        nFaces          172;
        startFace       204448;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  row_1_PER1_26;
        separationVector (0 -0.0495 0);
    }
    row_1_PER1_26
    {
        type            cyclic;
        inGroups        2(row_1_PER1 cyclic);
        nFaces          172;
        startFace       204620;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  row_1_PER2_25;
        separationVector (0 0.0495 0);
    }
    INLET
    {
        type            patch;
        nFaces          144;
        startFace       204792;
    }
    OUTLET
    {
        type            patch;
        nFaces          144;
        startFace       204936;
    }
    Blade
    {
        type            wall;
        inGroups        1(wall);
        nFaces          504;
        startFace       205080;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          102272;
        startFace       205584;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          102272;
        startFace       307856;
    }
)

// ************************************************************************* //
